12/data/attachments/1554102507c1ef2a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6d7ff4ba-9992-45e7-a513-fb032074ddca</nif:username>
            <nif:friendToBeAdded>Gary_discussion_Friend_36523_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>